{
  "Projects": [
    {
      "Project1": "Snap Still",
      "data": [
        {
          "name": "Snap Still",
          "short-description": "Snap Still is a film moodboard site, providing filmmakers and creatives with a platform to create visually stunning moodboards during the planning phases of their projects. Explore, organize, and bring your creative vision to life all in one place.",
          "live-link": "",
          "code-link": "",
          "image": "/img/SnapStill.png",
          "the-build": "Snap Still is the first React website I have ever built. This website was built using HTML,CSS, and React JS via CRA npm. The images are fetched from the Pexels API, and the mood board thumbnails are fetched from the Giphy API. I used localStorage to save the Pexel Api data to a mood board, in order for it to be accessed in each board's mood board page. The site features six initial categories of common emotions shown in film, and displays images in relation to each of those categories. Users are also given the opportunity to utilize the search engine, located at the top-right corner of each page.",
          "the-inspiration1": "The inspiration behind Snap Still is deeply rooted in my filmmaking background. As any filmmaker knows, the planning phase is absolutely crucial for successfully bringing a project to life, and that's where our trusty mood boards come to the rescue. 🎬🎥 A mood board is a collage of visual elements, carefully curated to evoke a specific mood, style, or concept. It lets you see the big picture and grasp the overall feel you want to convey in your project, and it’s a powerful tool that bridges the gap between imagination and reality.",
          "the-inspiration2": "In the past, I found myself resorting to PowerPoint or Google Slides, engaging in a convoluted process of hunting down images on Google, saving them to my desktop computer, organizing them into folders, and finally pasting them into my Slides or PowerPoint. Phew, all that for a task so simple! That's why I wanted to create a website like Snap Still. It’s a platform where creatives from all walks of life can effortlessly craft their mood boards. And with Snap Still, a user can create multiple mood boards in one convenient place, without all the unnecessary hassle.",
          "the-design": "As far as design goes, I was inspired by the site eycndy.com. The images pop from  the background, and they have collage style images shown as well. From the start I knew I wanted colorful elements against a dark background for that same effect. I also wanted the design to be simple. I designed the site in Figma and at first thought the site looked a bit too simple. So then I designed another version of the site and realized it looked  a bit too busy, so I decided to move along with my original design.",
          "the-learning": "Through this project, I discovered the importance of thorough research in the development process. As I progressed, I realized the need to delve deeper into React Hooks and localStorage . I spent a lot of time conducting extensive research during the building phase. This process not only expanded my knowledge of these concepts but also boosted my confidence in pursuing future React projects. I learned that conducting research is vital and that it’s okay to ask other fellow developers for help and feedback as well. I also learned about code etiquette, and keeping the code as neat as possible.This is where keeping a Constants file comes into play, to help keep the code clean, and also makes it easier for someone to reuse.",
          "id": "SnapStill"
        }
      ]
    },
    {
      "Project2": "The Commons",
      "data": [
        {
          "name": "The Commons",
          "short-description": "The Commons, is a platform that invites users to delve into the lives of lesser-known historical figures. Users can immerse themselves in stories through engaging audio narratives, allowing the individuals of the past to personally share their experiences, and users to gain a better undestanding of history.",
          "live-link": "",
          "code-link": "",
          "image": "/img/the_commons2.png",
          "the-build": "This website was built using HTML/CSS and React JS with the help of the CRA npm. I created it as a template design to showcase my vision for the final product. Since I couldn't find an API that met my specific needs, I gathered the data from a data.json file that I put together. The text-to-speech feature uses the VoiceRSS API to provide an interactive audio experience.",
          "the-inspiration1": "I'm a huge history buff and I absolutely love learning about people from the past. But you know what? In school, we only scratch the surface and barely touch on the thousands, maybe even millions, of incredible individuals who've made history. That got me thinking and inspired me to create The Commons.",
          "the-inspiration2": "My goal with The Commons was and is to bridge the gap between the past and the present. The Commons provides a platform where the people of yesterday  can speak directly to the people of today, sharing their unique narratives in first person.I wanted to create a more immersive experience that brings history to life by allowing users to hear these remarkable stories firsthand, from the individuals who lived them.",
          "the-design": "When designing The Commons, I knew I wanted to play around with some animation. As the idea for the website took shape, I sought inspiration on Behance, where I saw a design featuring a car and the sun in the background. The half-circle look caught my eye, and I knew I had to incorporate it. Interestingly, this design resembled an eye, sparking the creation of the site's motto: a glimpse into an eye's present and our past. Given that The Commons functions as a template site, my primary focus was to maintain a clean and elegant simplicity throughout.",
          "the-learning": "Within this project there are a few things I’ve learned. I learned more about incorporating third party libraries such as AOS for the scroll animations, instead of creating them manually-which helped me out a ton.I also learned more in depth about data fetching, as I had to debug an error in regards to the API I used.",
          "id": "TheCommons"
        }
      ]
    }
  ]
}
